# FilterNumericRuleEvaluator Properties

---
The FilterNumericRuleEvaluator type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FilterNumericRuleEvaluator Class
Autodesk.Revit.DB Namespace